{
  "guide_id": "source_type_02",
  "title": "How to Cite a Dissertation in APA Format (7th Edition)",
  "url": "/how-to-cite-dissertation-apa/",
  "page_type": "source_type",
  "content": "# How to Cite a Dissertation in APA Format (7th Edition)\n\nComplete guide to citing dissertations in APA 7. Covers published and unpublished dissertations, ProQuest, institutional repositories, and international dissertations.\n\n---\n\n<div class=\"quick-ref-box\">\n<h2>📋 Quick Reference</h2>\n<div class=\"template-box\">\nAuthor, A. A. (Year). <em>Title of dissertation</em> [Doctoral dissertation, Institution Name]. Database Name. https://doi.org/xxxxx\n</div>\n<p style=\"margin-top: 1rem; font-size: 0.875rem; color: #6b7280;\"><strong>Tip:</strong> Copy this template and replace with your source details.</p>\n</div>\n\n---\n\n<div class=\"mini-checker\">\n<h4>🔍 Try It Out</h4>\n<p>Paste a dissertation citation citation to check your formatting</p>\n<textarea placeholder=\"Author, A. A. (Year). Title of work...\"></textarea>\n<button>Check Citation</button>\n</div>\n\n---\n\n## Understanding Dissertation Citation Format in APA Style\n\nCiting a dissertation in APA style requires attention to specific formatting rules that ensure consistency and clarity. This guide will cover the essential components of dissertation citations, including author formatting, how to cite works with multiple authors, the use of URLs, and common pitfalls to avoid. \n\n### Author Formatting\n\nIn APA 7th edition, the formatting of authors' names is crucial for proper citation. When citing a dissertation, the author's name is presented in the following format:\n\n- Last Name, First Initial. Middle Initial.\n\nFor example, if the author's name is John Michael Smith, the citation will appear as:\n\n- Smith, J.M.\n\nThis format is applied to all reference types, including dissertations, journal articles, books, and webpages. Authors' names are inverted (last name first) only in the reference list. This rule is essential as it facilitates alphabetical ordering, making it easier for readers to locate sources within the reference list.\n\n### Citing Multiple Authors\n\nWhen a dissertation has two authors, both authors' names should be inverted in the reference list. They are separated by an ampersand (&) rather than the word 'and'. Each author's name follows the same format as for a single author. For instance:\n\n- Smith, J.M., & Johnson, A.B.\n\nThis format is used in both reference lists and parenthetical citations. For narrative citations, however, the word 'and' is used instead of the ampersand. For example:\n\n- Smith and Johnson (2020) discuss...\n\nThis distinction between the different citation styles is what sets APA apart from other formats. It helps maintain consistency across multi-author works.\n\n### Works with 21 or More Authors\n\nFor dissertations or any works with 21 or more authors, APA style requires listing the first 19 authors, followed by an ellipsis (...), and then the final author. This approach helps manage citations that would otherwise be unwieldy due to long author lists. Here is how it looks:\n\n- Smith, J.M., Johnson, A.B., Brown, C.D., Taylor, E.F., Miller, G.H., Wilson, I.J., Davis, K.L., Garcia, M.N., Martinez, O.P., Anderson, Q.R., Thomas, S.T., Jackson, U.V., White, W.X., Harris, Y.Z., Martin, A.B., Thompson, C.D., Robinson, E.F., Clark, G.H., Lewis, H.J., Lee, I.K., ... Williams, J.L.\n\nThis format allows for comprehensive author attribution while avoiding excessive length. Note that the ellipsis is not italicized or bracketed, which is a change from previous APA editions.\n\n### Author Titles and Suffixes\n\nWhen citing authors in APA format, it is important to include any titles or suffixes that may clarify their identity. For example, if an author is named John Smith Jr., it should be formatted as:\n\n- Smith, J., Jr.\n\nHowever, academic and professional credentials like Ph.D. or M.D. are usually omitted unless there are specific circumstances that warrant their inclusion. Titles such as Dr. or Professor are also not included in the reference list. This rule helps to maintain a clean and consistent reference list, avoiding unnecessary credential inflation.\n\n### URL Formatting\n\nWhen it comes to online sources, including dissertations available on the internet, APA 7th edition has simplified how URLs are presented. URLs should be inserted as live hyperlinks without any special formatting or punctuation. The 'Retrieved from' prefix that was previously required in APA 6 has been removed. \n\nFor example, a URL should look like this:\n\n- https://www.example.com/dissertation-title\n\nIt is important not to add a period at the end of the URL unless it is part of the original web address. This simplification aids in clarity and functionality for readers accessing the source digitally.\n\n### Examples of Dissertation Citations\n\nHere are a couple of examples that illustrate how to cite a dissertation in APA format:\n\n**Single Author Dissertation:**\n\nSmith, J.M. (2020). Title of the dissertation. University Name. URL\n\n**Two Authors Dissertation:**\n\nSmith, J.M., & Johnson, A.B. (2020). Title of the dissertation. University Name. URL\n\n**Dissertation with 21 or More Authors:**\n\nSmith, J.M., Johnson, A.B., Brown, C.D., Taylor, E.F., Miller, G.H., Wilson, I.J., Davis, K.L., Garcia, M.N., Martinez, O.P., Anderson, Q.R., Thomas, S.T., Jackson, U.V., White, W.X., Harris, Y.Z., Martin, A.B., Thompson, C.D., Robinson, E.F., Clark, G.H., Lewis, H.J., Lee, I.K., ... Williams, J.L. (2020). Title of the dissertation. University Name. URL\n\n### Importance of Formatting Rules\n\nFollowing these rules is essential for several reasons. Consistent citations enhance the credibility of your work, allow readers to locate sources easily, and maintain academic integrity. Proper formatting reflects attention to detail and respect for the original authors' contributions. \n\n### Practical Tips and Common Pitfalls\n\n1. **Double-Check Author Names:** Always verify the correct spelling and order of authors' names. Small errors can lead to confusion or misattribution.\n2. **Pay Attention to the Number of Authors:** Make sure to correctly apply the rules for two authors and for works with 21 or more authors.\n3. **Include URLs Properly:** Ensure that URLs are functional and do not have extraneous punctuation that could interfere with access.\n4. **Avoid Omitting Necessary Information:** While it is important to omit unnecessary titles and credentials, ensure you include all required elements, such as the year, title, and source.\n\nBy adhering to these guidelines and being mindful of common mistakes, you will ensure that your dissertation citations meet APA standards, contributing to the academic rigor of your work.\n\n---\n\n\n## Step-by-Step Instructions\n\n## What You Need\n\nBefore you begin creating a dissertation citation in APA 7th edition format, gather the following materials:\n\n1. **Dissertation or Thesis Document**: Ensure you have access to the complete document you are citing.\n2. **Author Information**: Collect the author's full name, including any suffixes, such as Jr. or III.\n3. **Title of the Dissertation**: Note the full title, including any subtitles.\n4. **Publication Year**: Find the year the dissertation was published.\n5. **Institution Name**: Identify the university or institution that awarded the degree.\n6. **URL or DOI**: If applicable, obtain the URL or DOI (Digital Object Identifier) for online access.\n\n## Step-by-Step Instructions\n\n### 1. **Identify the Author Information**  \n**Action**: Locate the author's full name from the dissertation.  \n**Verification**: Confirm you have the last name, first name, and middle name if available.  \n**Time Estimate**: 2 minutes.  \n**Tip**: Make sure to check the title page for accurate author details.\n\n### 2. **Format the Author's Name**  \n**Action**: Write the author's last name first, followed by a comma, then the first initial and middle initial, separated by periods.  \n**Verification**: Ensure the format looks like this: Last name, F.M.  \n**Time Estimate**: 2 minutes.  \n**Tip**: Use a text editor to easily adjust formatting.\n\n### 3. **Gather the Dissertation Title**  \n**Action**: Find the full title and subtitle of the dissertation.  \n**Verification**: Check that the title matches the document exactly, including capitalization and punctuation.  \n**Time Estimate**: 3 minutes.  \n**Tip**: Titles should be italicized in the final citation.\n\n### 4. **Note the Publication Year**  \n**Action**: Identify the year the dissertation was published, typically found on the title page or in the copyright section.  \n**Verification**: Make sure the year is correct and matches the publication date.  \n**Time Estimate**: 1 minute.  \n**Tip**: Double-check for any discrepancies in dates.\n\n### 5. **Record the Institution Name**  \n**Action**: Write down the full name of the institution that awarded the degree.  \n**Verification**: Confirm that the institution is spelled correctly.  \n**Time Estimate**: 1 minute.  \n**Tip**: Use the official name, as it may differ from common abbreviations.\n\n### 6. **Include the URL or DOI**  \n**Action**: If the dissertation is available online, find the URL or DOI.  \n**Verification**: Ensure the link is functional and correctly formatted, starting with http:// or https://.  \n**Time Estimate**: 3 minutes.  \n**Tip**: If there is no DOI, use the URL where the dissertation can be accessed.\n\n### 7. **Assemble the Citation**  \n**Action**: Combine all the elements you have gathered into the correct APA format. The general format for a dissertation citation is as follows:\n\n   Last Name, F.M. (Year). *Title of dissertation* (Publication No. [if available]) [Doctoral dissertation, Name of Institution]. URL or DOI\n\n**Verification**: Check that each part is correctly placed and formatted according to APA 7th edition guidelines.  \n**Time Estimate**: 5 minutes.  \n**Tip**: Use a citation generator as a double-check for accuracy.\n\n### 8. **Review and Edit Your Citation**  \n**Action**: Carefully review your complete citation for any formatting errors or typos.  \n**Verification**: Ensure it adheres to APA guidelines and is free of mistakes.  \n**Time Estimate**: 5 minutes.  \n**Tip**: Read the citation aloud or use a checklist to ensure all components are included.\n\n## Conclusion\n\nBy following these detailed steps, you can efficiently create an accurate dissertation citation in APA 7th edition format. Remember to gather all necessary information beforehand and take your time to ensure accuracy in formatting. With practice, this process will become quicker and easier.\n\n---\n\n## Common Errors for Dissertation Citation Citations\n\n<div class=\"error-example\">\n<strong>❌ Proper Noun Capitalization Error</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nResearch conducted at harvard university showed promising results\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nResearch conducted at Harvard University showed promising results\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students focus on sentence case rules but forget that proper nouns are always capitalized regardless of case rules</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Identify all proper nouns in the title including names of people</li>\n<li>Ensure names of places, organizations, and institutions are capitalized</li>\n<li>Capitalize specific geographic names and locations mentioned</li>\n<li>Maintain capitalization of brand names and historical events referenced</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Subtitle Capitalization Error</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nSocial development in early childhood: theoretical perspectives\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nSocial development in early childhood: Theoretical perspectives\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students forget that subtitles are treated as separate sentences for capitalization purposes</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Locate all colons in the title that separate main title from subtitle</li>\n<li>Capitalize the first word immediately following each colon without exception</li>\n<li>Apply sentence case or title case rules to remaining subtitle words appropriately</li>\n<li>Ensure subtitle capitalization matches the type of title case being used</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Acronym Capitalization Error</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nThe role of cdc guidelines in pandemic response\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nThe role of CDC guidelines in pandemic response\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students don't know when acronyms should be in all capitals versus following sentence case rules</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Identify well-known acronyms like CDC, NASA, APA, FBI that are widely recognized</li>\n<li>Keep these acronyms in all capitals regardless of sentence case rules</li>\n<li>For lesser-known acronyms, follow standard usage or title case rules</li>\n<li>Check if acronym is commonly written in all caps in professional contexts</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Inconsistent Capitalization</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nThe Impact of Social Media on Adolescent Mental Health: A longitudinal Study\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nThe impact of social media on adolescent mental health: A longitudinal study\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students partially apply rules but are inconsistent, mixing sentence and title case</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Choose correct case type for the source type first</li>\n<li>Apply rules consistently throughout the entire title without exception</li>\n<li>Double-check all words against the chosen case rules</li>\n<li>Review title for consistent application of capitalization throughout</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ First Word Not Capitalized</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nthe impact of social media on adolescent mental health\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nThe impact of social media on adolescent mental health\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students focus on sentence case rules but forget the basic rule to always capitalize the first word</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Always capitalize the first word of any title without exception</li>\n<li>This applies regardless of sentence case or title case formatting used</li>\n<li>Check the very first character of the title for proper capitalization</li>\n<li>Ensure first word is capitalized even if it's a minor word type</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Inconsistent Italics Usage</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\n*Journal of Clinical Psychology*, 45(3), 234-256. *New York, NY*: Academic Press.\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\n*Journal of Clinical Psychology*, 45(3), 234-256. New York, NY: Academic Press.\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students extend italics beyond appropriate boundaries or apply them inconsistently</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Review italics boundaries carefully in citation formatting</li>\n<li>Italicize only titles and volume numbers in reference lists</li>\n<li>Keep all other elements like publisher location in plain text</li>\n<li>Ensure italics start and stop at appropriate points</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Missing Period After Author Initials</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M K (2020). The study of psychology.\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020). The study of psychology.\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students omit periods after initials, especially when multiple initials are present</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Add period after each initial in author name formatting</li>\n<li>Ensure all initials have periods following them consistently</li>\n<li>Check that no initials are missing periods in reference lists</li>\n<li>Verify spacing between initials with periods is correct</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Extra Space Between Initials</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020). The study of psychology.\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M.K. (2020). The study of psychology.\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students space initials like regular words, not realizing they should be compact</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Remove spaces between initials in author name formatting</li>\n<li>Keep initials together without spacing between them</li>\n<li>Maintain periods after each initial without extra spacing</li>\n<li>Check that initials appear as M.K. not M. K. in citations</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Missing Period After Year</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020) The study of psychology\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020). The study of psychology\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students focus on the year in parentheses but forget the period after closing parenthesis</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Add period after closing parenthesis of year in citations</li>\n<li>Ensure year is in parentheses followed by period consistently</li>\n<li>Check that year information is complete with proper period</li>\n<li>Verify spacing between year period and title is correct</li>\n</ul>\n</div>\n\n---\n\n<div class=\"error-example\">\n<strong>❌ Missing Period at End of Citation</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020). The study of psychology. *Journal of Clinical Psychology*, 45(3), 234-256\n</div>\n</div>\n\n<div class=\"correction-box\">\n<strong>✓ Correct Format:</strong>\n<div style=\"font-family: 'Courier New', monospace; margin-top: 0.5rem;\">\nJohnson, M. K. (2020). The study of psychology. *Journal of Clinical Psychology*, 45(3), 234-256.\n</div>\n</div>\n\n<div class=\"note-box\">\n<strong>Why This Happens:</strong>\n<p>Students focus on internal punctuation but forget the citation must end with a period</p>\n<strong>How to Avoid It:</strong>\n<ul>\n<li>Add period at the very end of the citation reference</li>\n<li>Ensure citation ends with proper punctuation consistently</li>\n<li>Check that no citation is missing final period in reference list</li>\n<li>Verify that final period is not preceded by extra spacing</li>\n</ul>\n</div>\n\n---\n\n\n<div class=\"mini-checker\">\n<h4>✨ Ready to Check Your Full Reference List?</h4>\n<p>Validate your entire bibliography at once with our citation checker</p>\n<button style=\"background: #22c55e;\">Check Full Reference List →</button>\n</div>\n\n---\n\n## Validation Checklist\n\n<div class=\"checklist\">\n<p>Before submitting your Dissertation Citation citation, verify:</p>\n<ul>\n<li>In APA 7th edition, single authors are formatted with last name followed by a comma and first and middle initials. The initials should be separated by periods but not spaces. This format applies to all reference types including journal articles, books, and webpages. The author's name should be inverted (last name first) in the reference list only. This rule ensures consistency across all citation formats and makes alphabetical ordering more efficient in reference lists.</li>\n<li>For works with two authors, both names should be inverted (last name first) and separated by an ampersand (&) rather than the word 'and'. Each author's name follows the single author format (Last name, initials). The ampersand should be preceded by a comma. This format is used in both reference lists and parenthetical citations, but narrative citations use 'and' instead of '&'. This rule distinguishes APA from other citation styles and maintains consistency across multi-author works.</li>\n<li>For works with 21 or more authors, list the first 19 authors, insert an ellipsis (...), then list the final author. The ellipsis replaces authors 20 through the second-to-last author. All listed authors follow the standard inverted format. This rule prevents extremely long citation lists while still providing key attribution information. The ellipsis should not be italicized or bracketed. This change from APA 6th edition's 7+ author rule provides more comprehensive author listing.</li>\n<li>Author titles, suffixes, and credentials (like Jr., Sr., II, III, Ph.D., M.D.) should be included in the reference list. Suffixes like Jr., Sr., II, and III follow the initials, separated by commas. Academic and professional credentials are generally omitted from reference list entries but may be included in special circumstances. Titles like Dr., Professor, or military ranks are not included in reference list citations. This rule provides complete identification when needed while avoiding unnecessary credential inflation.</li>\n<li>When including URLs for websites, online documents, or other sources without DOIs, present them as live hyperlinks without any special formatting or punctuation. APA 7 removes the 'Retrieved from' prefix that was required in APA 6 for most URLs. URLs should be presented in their simplest form, beginning with http:// or https://, and should be hyperlinks in digital documents. Do not add a period at the end of a URL unless it is part of the original URL. This simplification makes citations cleaner while maintaining functionality for digital access to sources.</li>\n<li>When a URL or DOI leads to a broken or inactive link, APA 7 provides several options for handling the citation. If the source is available through an archive like the Internet Archive, include the archived URL. If the source cannot be located, include as much information as possible and note that the resource is no longer available. For journal articles with broken DOIs, include the DOI but add a note indicating it's inactive. The principle is to provide enough information for readers to locate the source if possible, while acknowledging access limitations. This represents more detailed guidance than APA 6 provided for handling broken links.</li>\n<li>For sources from academic databases, APA 7 simplifies formatting by generally omitting database names and URLs. Most scholarly articles found in databases should be cited using their DOI rather than the database URL. Only include database information when the source is exclusive to that database and cannot be found elsewhere, such as with dissertations or some reports. This represents a major change from APA 6, where database names and retrieval information were commonly included. The principle is to provide the most direct and permanent path to the source, which is typically through the DOI rather than database-specific access information.</li>\n</ul>\n</div>\n\n---\n\n## Special Cases\n\n## Citing Dissertations in APA 7th Edition\n\nCiting dissertations in APA 7th edition follows specific guidelines that ensure consistency and clarity. Dissertations can be unique sources that require careful attention to detail when referencing them. This guide will cover special cases and edge cases in dissertation citations, providing examples and explanations to help you navigate these situations.\n\n### Basic Format for Dissertations\n\nWhen citing a dissertation, the basic format should include the author's last name, followed by their initials. The title of the dissertation should be italicized and followed by the description in square brackets, such as [Doctoral dissertation]. The name of the institution should also be included, along with the URL if available.\n\n**Basic Format:**\n\nAuthor, A. A. (Year). Title of the dissertation [Doctoral dissertation, Name of Institution]. URL\n\n### Special Cases\n\n#### Multiple Authors\n\nWhen a dissertation has more than one author, the citation must reflect this. For two authors, both names should be inverted. For three or more authors, the first 19 authors should be listed before the ellipsis, which is followed by the last author's name.\n\n**Example for Two Authors:**\n\nSmith, J. A., & Doe, R. B. (2022). Investigating the effects of study habits on academic performance [Doctoral dissertation, University of Education]. http://doi.org/10.1234/abcd\n\n**Example for More than Two Authors:**\n\nJohnson, L. M., Chen, Y., Rodriguez, P., Lee, S., Taylor, R., ... Smith, A. K. (2021). The impact of technology on learning outcomes [Doctoral dissertation, University of Innovation]. http://doi.org/10.5678/wxyz\n\n#### Including Suffixes\n\nIf the author has a suffix, such as Jr., Sr., II, or III, it should be included in the citation. The suffix follows the initials and is separated by a comma.\n\n**Example with Suffix:**\n\nBrown, T. J., Jr. (2020). An analysis of community development strategies [Doctoral dissertation, Community University]. http://doi.org/10.9101/efgh\n\n### Edge Cases\n\n#### Dissertations without a DOI\n\nIf a dissertation does not have a DOI, you should include the URL of the database or repository where it is housed. Ensure that the URL is in its simplest form and does not include a period at the end.\n\n**Example without DOI:**\n\nGarcia, M. L. (2023). The role of environmental factors in health outcomes [Doctoral dissertation, Green University]. https://www.greenuniversity.edu/dissertations/garcia2023\n\n#### Unpublished Dissertations\n\nIf the dissertation is unpublished, it is important to clarify this in the citation. You would indicate that it is unpublished by including [Unpublished doctoral dissertation] in the citation.\n\n**Example of Unpublished Dissertation:**\n\nRoberts, K. T. (2022). Exploring the effects of stress on student performance [Unpublished doctoral dissertation]. University of Research.\n\n### Why These Rules Matter\n\nAPA citation rules are designed to provide clarity and consistency in academic writing. By adhering to these guidelines, you ensure that your sources are easily identifiable and that readers can locate them if necessary. This not only enhances the credibility of your work but also respects the intellectual property of the original authors.\n\n### Practical Tips\n\n1. **Double-Check Author Order**: When citing multiple authors, ensure that you list them in the correct order as they appear in the dissertation. This is crucial for giving proper credit.\n\n2. **Use the Correct Title Format**: Remember to italicize the title of the dissertation and use sentence case. Only the first word of the title and subtitle, as well as proper nouns, should be capitalized.\n\n3. **Stay Updated on DOIs**: Always check if the dissertation has a DOI available, as this is preferred over a URL. If a DOI is present, use it instead of the URL.\n\n4. **Be Mindful of Online Access**: If the dissertation is only available through a database, do not include a URL unless it is publicly accessible.\n\n### Common Pitfalls\n\n- **Forgetting the Ellipsis**: When citing works with more than 20 authors, the ellipsis must be included correctly to avoid confusion.\n- **Incorrect URL Formatting**: Be cautious not to add a period at the end of a URL, as this can lead to broken links.\n- **Neglecting to Add Suffixes**: If an author has a suffix, failing to include it can lead to misidentification of the author.\n\n### Conclusion\n\nCiting dissertations correctly in APA format is essential for maintaining academic integrity and ensuring that your work is taken seriously. By understanding the special cases and edge cases discussed in this guide, you can navigate the complexities of dissertation citations with confidence. Following these rules will not only improve the quality of your references but also enhance the overall professionalism of your academic writing.\n\n---\n\n## Frequently Asked Questions\n\n### How do I cite a dissertation in APA format?\n\nTo cite a dissertation in APA format, you need to include the author's last name, first initial, publication year, title of the dissertation in italics, the designation 'Doctoral dissertation' or 'Master's thesis', the name of the institution, and a URL if available. For example, a citation might look like this: Smith, J. (2020). Title of the dissertation: A comprehensive study. Doctoral dissertation, University of Example. Retrieved from http://example.com/dissertation. It is important to ensure that you follow the correct format for the specific type of dissertation you are citing. For more information, you can refer to the APA Publication Manual or the APA Style website.\n\n---\n\n### What if the dissertation is unpublished?\n\nWhen citing an unpublished dissertation in APA format, you should still follow a similar structure but indicate that it is unpublished. For instance, your citation would look like this: Doe, A. (2022). Title of the dissertation: An exploration of themes. Unpublished doctoral dissertation, University of Example. This clearly communicates to the reader that the work is not available in published form. If you later find a published version, you should update your citation accordingly. For more detailed guidance, check the APA Style website or the latest edition of the APA Publication Manual.\n\n---\n\n### How do I format a citation for a dissertation retrieved from a database?\n\nWhen citing a dissertation retrieved from a database, you should include the author's last name, first initial, the publication year, the title of the dissertation in italics, the designation as either 'Doctoral dissertation' or 'Master's thesis', the name of the institution, and the database name. For example: Johnson, L. (2021). Title of the dissertation: Analysis of trends. Doctoral dissertation, University of Example. ProQuest Dissertations Publishing. This indicates where the dissertation can be found. If available, include the DOI as well. For further details, consult the APA Style website.\n\n---\n\n### What is the difference between citing a dissertation and a thesis?\n\nIn APA format, a thesis usually refers to a master's thesis, while a dissertation refers to a doctoral dissertation. The main difference lies in the level of research and the requirements set by the institution. When citing, you should specify which type of work you are referencing. For example, for a master's thesis, your citation would look like this: Taylor, R. (2023). Title of the thesis: Study of community impacts. Master's thesis, University of Example. For a doctoral dissertation, you would use the designation 'Doctoral dissertation'. This distinction helps the reader understand the level of research and the context behind the work. For more clarification, you can refer to the APA Publication Manual.\n\n---\n\n### Do I need to include the retrieval date for online dissertations?\n\nIn APA format, you generally do not need to include the retrieval date for online dissertations unless the content is subject to change. For stable sources like dissertations that are archived and unlikely to change, simply providing the URL or DOI is sufficient. For example: Lee, M. (2019). Title of the dissertation: Innovations in research. Doctoral dissertation, University of Example. Retrieved from http://example.com/dissertation. However, if you are referencing a webpage that continuously updates, then you would include the retrieval date. For additional guidance, the APA Style website offers comprehensive resources.\n\n---\n\n### Can I cite a dissertation from a different citation style in APA format?\n\nIf you have a dissertation that was cited in a different citation style, you can convert it to APA format by following the specific guidelines for APA citations. Start by identifying the key components of the citation, such as the author's name, the publication year, the title of the dissertation, and the institution. Then, rearrange these elements to fit the APA structure. It may be helpful to refer to the APA Style Manual or online resources for assistance. For instance, if the original citation is in MLA format, you would need to ensure you follow APA's guidelines for italics, punctuation, and order. For a comprehensive overview, visit the APA Style website.\n\n---\n\n\n---\n\n**Last Updated:** 2025-10-26\n**Reading Time:** 10 minutes",
  "metadata": {
    "page_type": "source_type",
    "meta_title": "How to Cite a Dissertation in APA Format (7th Edition)",
    "meta_description": "Complete guide to citing dissertations in APA 7. Covers published and unpublished dissertations, ProQuest, institutional repositories, and international dissertations.",
    "word_count": 4725,
    "reading_time": "23 minutes",
    "last_updated": "2025-10-26"
  },
  "llm_review": {
    "overall_verdict": "PASS",
    "issues_found": [
      {
        "severity": "medium",
        "issue": "Meta description length: 167 chars (ideal: 120-160)",
        "location": "Meta description",
        "suggestion": "Adjust description length for optimal click-through rate"
      },
      {
        "severity": "low",
        "issue": "Only 0 internal links found (ideal: 8-15)",
        "location": "Internal linking",
        "suggestion": "Add more internal links to related pages"
      },
      {
        "severity": "medium",
        "issue": "The template for citing a dissertation does not include the retrieval date for unpublished dissertations.",
        "location": "Quick Reference",
        "suggestion": "Include a note that unpublished dissertations should have a retrieval date if accessed online."
      },
      {
        "severity": "medium",
        "issue": "The example for citing multiple authors does not clarify that the ampersand is used only in the reference list, which may lead to confusion.",
        "location": "Citing Multiple Authors",
        "suggestion": "Add a brief sentence to explicitly state that the ampersand is only used in the reference list, not in narrative citations."
      },
      {
        "severity": "low",
        "issue": "The phrase 'Check for:' is not necessary and interrupts the flow of the text.",
        "location": "Understanding Dissertation Citation Format in APA Style",
        "suggestion": "Remove the phrase 'Check for:' to improve readability."
      }
    ],
    "word_count": 4725,
    "uniqueness_score": 0.85,
    "review_summary": "Found 5 issues: 3 medium, 2 low"
  },
  "word_count": 4725,
  "generated_at": "2025-10-26T20:30:15.802965"
}